package com.lviv.pedigree;

/*Создать приложение родословная.
        Приложение должно позволять:
        1) Выводить родословное дерево конкретного человека.
        2) Показывать прямых родственников
        3) Вычислять статистику по всему дереву:
        количество живых, мужчин/женщин, среднее количество детей, среднюю продолжительность жизни
        4) Отображать в дереве место и даты рождения и свадьбы, место жительства, профессию и другую информацию о персоне;
        5) Показывать прямых родственников с братьями и сёстрами, все родственники.
        6) Показывать степень родства двух людей.*/
public class Main {

    public static void main(String[] args) {

    }
}
